/* Найти квадрат вводимого числа пользователем. */

System.Console.WriteLine("Введите число: ");
int userNumber = Convert.ToInt32(Console.ReadLine());

int result = userNumber * userNumber;
System.Console.WriteLine (result);